x=[-3.9847,-3.5549,-1.2401,-0.9780,-0.7932,-2.8531;
    -2.7605,-3.7287,-3.5414,-2.2692,-3.4549,-3.0752;
    -3.9934,2.8792,-0.9780,0.7932,1.1882,3.0682;
    -1.5799, -1.4885,-0.7431,-0.4221,-1.1186,4.2532]
 y=zeros(4,6);           %定义y为
 disp('基于最小风险的识别过程的结果如下');
 for i=1:4               
    for j=1:6             
        y(i,j)=func(x(i,j)); %对y中的所有元素调用函数
    end
 end
 disp('y中不正常细胞为"1"，正常细胞为"2"');
 y                       %输出y为分类矩阵
 
 disp('基于最小错误率的识别过程的结果如下');
 for i=1:4               
    for j=1:6             
        y(i,j)=minerror(x(i,j)); %对y中的所有元素调用函数
    end
 end
 disp('y中不正常细胞为"1"，正常细胞为"2"');
 y                       %输出y为分类矩阵
 