h=0.025;
y0=-2;
n=80;
A=-3+2*(1+exp(-4))^(-1);
for i=1:n
    y=y0-h*(y0+1)*(y0+3);
    y0=y;
end
disp('欧拉方法')
disp(y0)
disp(abs(A-y0))
 
n1=40;
h1=0.05;
y1=-2;
for i=1:n1
    k1=-(y1+1)*(y1+3);
    k2=-(h1*k1+y1+1)*(y1+h1*k1+3);
    y1=y1+0.5*h1*(k1+k2);
end
disp('改进欧拉方法')
disp(y1)
disp(abs(A-y1))
 
n2=20;
h2=0.1;
y2=-2;
for i=1:n2
    k11=-(y2+1)*(y2+3)*h2;
    k22=-h2*(0.5*k11+y2+1)*(0.5*k11+y2+3);
    k33=-h2*(0.5*k22+y2+1)*(0.5*k22+y2+3);
    k44=-h2*(y2+1+k33)*(y2+3+k33);
    y2=y2+(k11+2*k22+2*k33+k44)/6;
end
disp('四阶R-K')
disp(y2)
disp(abs(A-y2))
